app/controllers/application_controller.rb

  def find_current_user
    authenticate_with_http_token do | token, options |
      data = decode(token)
      data && User.find(data[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]