app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY created_at desc
---
    def index
      @user = User.find(params[:user_id])
      @posts = Post.where(user_id: @user.id)
      posts = @posts.order("created_at desc")

INSERT INTO "posts" ("body", "description", "posted_by", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "now"], ["description", "now"], ["posted_by", "bob"], ["created_at", "2019-04-09 03:04:52.107878"], ["updated_at", "2019-04-09 03:04:52.107878"], ["user_id", 1]]
---
  def create
    post = current_user.posts.create!(post_params)