app/controllers/users_controller.rb

  def create
    email = params[:email]
    password = params[:password]
    name = params[:name]

    new_user = User.new({
      password: password,
      email: email,
      name: name
    })


    if new_user.valid?
      new_user.save!
---
INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def login
    email = params[:email]
    password = params[:password]

    user = User.find_from_credentials email, password
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "cat@cat.com"], ["LIMIT", 1]]

  def index
    render json: { users: User.all }
---
SELECT "users".* FROM "users"