app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "cat@cat.com"], ["LIMIT", 1]]
---
  def self.find_from_credentials(email, password)
    user = self.find_by(email: email)